notmuch.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-02-15 Thu 01:00 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs - Notmuch</title>
<meta name="author" content="shaka" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="default.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Emacs - Notmuch</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb53d42b">Introduction</a></li>
<li><a href="#org950d21f">Installation</a></li>
<li><a href="#org01c4bae">Configuration</a>
<ul>
<li><a href="#org1a29518"><code>~/.notmuch-config</code></a></li>
<li><a href="#org93a43bf"><code>~/.emacs.d/init.el</code></a></li>
<li><a href="#org9546224">Hooks</a></li>
<li><a href="#orga3b8083">Automatics</a></li>
<li><a href="#orgf2e70dc">CJK Support</a></li>
</ul>
</li>
<li><a href="#org9bf817f">Key binding</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb53d42b" class="outline-2">
<h2 id="orgb53d42b">Introduction</h2>
<div class="outline-text-2" id="text-orgb53d42b">
<p>
<code>Notmuch</code> is a mail system<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>. It can efficiently manage a fairly large number of emails. Particularly, it supports fast email searching and filtering based on tags, which is extremely similar to Gmail's tags whereby various virtual folders can be flexibly realized.
</p>

<p>
This post is composed just to summarize the basic installation and configuration of <code>notmuch</code>-based mail system.
</p>
</div>
</div>
<div id="outline-container-org950d21f" class="outline-2">
<h2 id="org950d21f">Installation</h2>
<div class="outline-text-2" id="text-org950d21f">
<div class="org-src-container">
<pre class="src src-sh">pacman -S notmuch
</pre>
</div>
</div>
</div>
<div id="outline-container-org01c4bae" class="outline-2">
<h2 id="org01c4bae">Configuration</h2>
<div class="outline-text-2" id="text-org01c4bae">
</div>
<div id="outline-container-org1a29518" class="outline-3">
<h3 id="org1a29518"><code>~/.notmuch-config</code></h3>
<div class="outline-text-3" id="text-org1a29518">
<p>
The basic configuration can be performed by either
</p>
<ul class="org-ul">
<li>an interactive guidance which can be provoked by</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh">notmuch setup
</pre>
</div>
<ul class="org-ul">
<li>or a manually composed <code>~/.notmuch-config</code> as follows</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh">[database]
# Mail storage in maildir format
path=/MAIL/REPO

[user]
name=NAME
primary_email=EMAILADDRESS

[new]
tags=unread;inbox;
ignore=

[search]
exclude_tags=deleted;spam;

[maildir]
synchronize_flags=true

[crypto]
gpg_path=gpg
</pre>
</div>
</div>
</div>
<div id="outline-container-org93a43bf" class="outline-3">
<h3 id="org93a43bf"><code>~/.emacs.d/init.el</code></h3>
<div class="outline-text-3" id="text-org93a43bf">
<p>
Add following content to the configuration of Emacs.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(require 'notmuch)
(setq user-full-name "NAME"
      user-mail-address "EMAILADDRESS")

(setq mail-user-agent 'message-user-agent
      message-kill-buffer-on-exit t
      mm-text-html-renderer 'w3m)

(setq notmuch-search-oldest-first nil
      notmuch-show-all-multipart/alternative-parts nil
      mail-interactive t
      notmuch-always-prompt-for-sender nil
      notmuch-show-indent-messages-width 3)

(setq mail-specify-envelope-from t
      message-sendmail-envelope-from 'header
      mail-envelope-from 'header)

(setq message-directory "."
      notmuch-fcc-dirs ".")

(setq message-send-mail-function 'smtpmail-send-it
      smtpmail-smtp-server "SMTPSERVER"
      smtpmail-stream-type 'ssl
      smtpmail-smtp-service PORT)

(setq notmuch-saved-searches '((:name "inbox"
                                      :query "tag:inbox"
                                      :count-query "tag:inbox and tag:unread"
                                      :sort-order newest-first)
</pre>
</div>
</div>
</div>
<div id="outline-container-org9546224" class="outline-3">
<h3 id="org9546224">Hooks</h3>
<div class="outline-text-3" id="text-org9546224">
<p>
Additionally, notmuch supports hooks which are essentially scripts in <code>/MAIL/REPO/.notmuch/hooks</code> whereby users can specify and customize the behaviors of notmuch. Currently, following scripts and hooks are available.
</p>
<dl class="org-dl">
<dt><code>pre-new</code></dt><dd>Hook/script provoked before command <code>notmuch new</code>, which is usually used to fetch mails.</dd>
</dl>
<div class="org-src-container">
<pre class="src src-sh">#!/bin/sh
/usr/bin/offlineimap -c /PATH/TO/OFFLINEIMAPRC -a ACCOUNT
</pre>
</div>
<p>
or
</p>
<div class="org-src-container">
<pre class="src src-sh">#!/bin/sh
/usr/bin/getmail --new --getmaildir=/PATH/TO/GETMAILRC --rcfile=GETMAILRC
</pre>
</div>
<dl class="org-dl">
<dt><code>post-new</code></dt><dd>Hook/script provoked after command <code>notmuch new</code>, which is usually used to tag the newly imported mails.</dd>
</dl>
<div class="org-src-container">
<pre class="src src-sh">#!/bin/sh
notmuch tag -inbox +ML -- to:MAILLIST@EXAMPLE.COM
notmuch tag -inbox +SOMEONE -- from:SOMEONE@EXAMPLE.COM
/usr/bin/notmuch search --output=files tag:deleted OR tag:spam | xargs -r rm
</pre>
</div>
<dl class="org-dl">
<dt><code>post-insert</code></dt><dd>Hook/script called after command <code>notmuch insert</code>, which is provoked after mails are delivered, imported into database and labelled with initial tags.</dd>
</dl>
<div class="org-src-container">
<pre class="src src-sh">#!/bin/sh
notmuch tag -inbox -unread +sent -- from:MYEMAILADDRESS
/usr/bin/notmuch search --output=files tag:deleted OR tag:spam | xargs -r rm
</pre>
</div>
</div>
</div>
<div id="outline-container-orga3b8083" class="outline-3">
<h3 id="orga3b8083">Automatics</h3>
<div class="outline-text-3" id="text-orga3b8083">
<ul class="org-ul">
<li>Add new intended task by <code>crontab -e</code> with following content</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh">*/5 * * * * /usr/bin/notmuch new
</pre>
</div>
<p>
where the first line is for periodical fetching mail every 3 minutes and the second line to remove the mails deleted (tagged by <code>deleted</code>) at every boot.
</p>
<ul class="org-ul">
<li>Enable and start the service <code>cronie</code>.</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh">systemctl enable cronie.service
systemctl start cronie.service
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf2e70dc" class="outline-3">
<h3 id="orgf2e70dc">CJK Support</h3>
<div class="outline-text-3" id="text-orgf2e70dc">
<p>
By default, notmuch cannot separate Chinese correctly, Japanese, or Korean words due to the non-space separator. A workaround is to <a href="https://notmuchmail.org/howto/#index10h2">set a environment variable</a> as follows.
</p>
<div class="org-src-container">
<pre class="src src-shell">export XAPIAN_CJK_NGRAM=1
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org9bf817f" class="outline-2">
<h2 id="org9bf817f">Key binding</h2>
<div class="outline-text-2" id="text-org9bf817f">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b>Key</b></th>
<th scope="col" class="org-left">Function and description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>n/p</code></td>
<td class="org-left">Next/previous message, <code>notmuch-tree-next-matching-message</code></td>
</tr>

<tr>
<td class="org-left"><code>M-n/p</code></td>
<td class="org-left">Next/previous thread, <code>notmuch-tree-next-thread</code></td>
</tr>

<tr>
<td class="org-left"><code>w</code></td>
<td class="org-left">Save attachments, <code>notmuch-show-save-attachments</code></td>
</tr>

<tr>
<td class="org-left"><code>m</code></td>
<td class="org-left">Write a new mail, <code>notmuch-mua-new-mail</code></td>
</tr>

<tr>
<td class="org-left"><code>r</code></td>
<td class="org-left">Reply a mail, <code>notmuch-show-reply-sender</code></td>
</tr>

<tr>
<td class="org-left"><code>R</code></td>
<td class="org-left">Reply all, <code>notmuch-show-reply</code></td>
</tr>

<tr>
<td class="org-left"><code>f</code></td>
<td class="org-left">Forward a mail, <code>notmuch-show-forward-message</code></td>
</tr>

<tr>
<td class="org-left"><code>C-c C-a</code></td>
<td class="org-left">Attach a file, <code>mml-attach-file</code></td>
</tr>

<tr>
<td class="org-left">=</td>
<td class="org-left">Refresh current buffer, <code>notmuch-refresh-this-buffer</code></td>
</tr>

<tr>
<td class="org-left"><code>M-=</code></td>
<td class="org-left">Refresh all buffer, <code>notmuch-refresh-all-buffers</code></td>
</tr>

<tr>
<td class="org-left"><code>z</code></td>
<td class="org-left">Display threads matching query in tree view, <code>notmuch-tree</code></td>
</tr>

<tr>
<td class="org-left"><code>Z</code></td>
<td class="org-left">Tree view for the current query, <code>notmuch-tree-from-search-current-query</code></td>
</tr>

<tr>
<td class="org-left"><code>+</code></td>
<td class="org-left">Change (add by default) tags for the current thread or region, <code>notmuch-search-add-tag</code></td>
</tr>

<tr>
<td class="org-left"><code>-</code></td>
<td class="org-left">Change (remove by default) tags for the current thread or region, <code>notmuch-search-remove-tag</code></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<a href="https://notmuchmail.org/">https://notmuchmail.org/</a>
</p></div></div>


</div>
</div></div>
</body>
</html>
